PROFILE_EMPTY = "Ваш профиль пуст."

PROFILE_SUMMARY = (
    "💼 Общая стоимость портфеля: {total} ₽\n\n{table}"
)

ENTER_TICKER = "✨ Введите тикер акции, которую хотите добавить:"

INVALID_TICKER = (
    "❌ Некорректный тикер акции. Тикер должен состоять из 1–5 латинских букв и/или цифр.\n\nПопробуйте снова."
)

ENTER_PRICE = "✨ Введите цену акции (или '-' для использования текущей рыночной цены):"

FAILED_TO_GET_PRICE = "❌ Не удалось получить текущую цену для {ticker}. Пожалуйста, введите цену вручную."

CURRENT_PRICE_TEXT = "✨ Текущая цена {ticker}: {price:.2f} руб.\n\nВведите количество акций:"

ENTER_COUNT = "✨ Введите количество акций:"

INVALID_PRICE = "❌ Пожалуйста, введите корректную цену или '-' для использования текущей цены."

INVALID_COUNT = "❌ Пожалуйста, введите корректное количество (целое число больше 0)."

ENTER_TICKER_TO_DELETE = ("🗑️ Введите тикер акции, которую хотите удалить "
                          "(или 'all' - если хотите очистить профиль полностью):")

SHARE_NOT_FOUND = "❌ У вас нет акций с таким тикером. Попробуйте снова!"

CURRENT_SHARE_COUNT = ("🗑️ Текущее количество акций {ticker}: {count}(шт)."
                       "\n\nВведите количество для удаления (или 'all' для полной продажи):")

INVALID_DELETE_COUNT = "❌ Введите корректное количество (больше 0) или 'all'."

DELETE_ERROR = "❌ Ошибка при удалении."
